Обработки/Reports/_ОтчетОДоходахИРасходахФОГФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахФОГФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахФОГФ/Ext/ObjectModule.bsl
//Перем ОбластиИЗначения;

Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о доходах и расходах (ФОГФ)",
		"0.31",
		"",
		Истина);
		                                                                                                              
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект",			ЭтотОбъект.Организация);
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантРуководитель);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантГлавбух);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Новый ТабличныйДокумент);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПодписантГлавбух");
	Настройки.Добавить("ПодписантРуководитель");	
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Процедура Сформировать(ДокументРезультат, ДокументРасшифровка) Экспорт 
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);	

	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	ТипЧисло = Новый ОписаниеТипов("Число"); 
	
	ОбластиИЗначения = Новый Структура;
	
	//таблицы с расшифровками прочих доходов и Расходов
	ПрочиеДоходы = Новый ТаблицаЗначений;
	ПрочиеДоходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходы.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходы = Новый ТаблицаЗначений;
	ПрочиеРасходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходы.Колонки.Добавить("Сумма", ТипЧисло);	
	
	//колонки как запросе к 91-му. кроме Фильтра и Строки Отчета
	ТабРасшифровки = Новый ТаблицаЗначений;
	ТабРасшифровки.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровки.Колонки.Добавить("Счет");
	ТабРасшифровки.Колонки.Добавить("КорСчет");
	ТабРасшифровки.Колонки.Добавить("ПрочиеДоходыРасходы");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумагиНаименование");
	ТабРасшифровки.Колонки.Добавить("ОбращаетсяНаОРЦБ");
	ТабРасшифровки.Колонки.Добавить("Фильтр");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровки.Колонки.Добавить("Регистратор");
	
	ДатаНачальная = Период.ДатаНачала;
	ДатаКонечная = Период.ДатаОкончания;	
	
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");	
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.БухгалтерскийУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.БухгалтерскийУчет);
			
	МакетНастройка = ПолучитьМакет("Настройка");
	
	//БУ
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	Если ТаблицаНастройки.Количество() = 0 Тогда 
		Сообщить("Отсутствует настройка для отчета");
		Возврат;
	КонецЕсли;	
		
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(Организация, СчетДоверительногоУправления, ДатаКонечная, "БухгалтерскийУчет", ДатаНачальная, Истина);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "Б0708", "Б0809", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы);
	
	//купон по необращаемым облигациям должен входить в два раздела   
	СуммаБ0709н = ОбщиеФункции.ВернутьСохраненноеЗначение("Б0709н", ОбластиИЗначения);
	Если СуммаБ0709н <> 0 Тогда
		ЗапомнитьСумму("Б0709", СуммаБ0709н, ОбластиИЗначения, Ложь);     // добавим  к НКД корпоративные
		ЗапомнитьСумму("Б0700", СуммаБ0709н, ОбластиИЗначения, Ложь);     // добавим в итог стр 7.
		ЗапомнитьСумму("Б1000", СуммаБ0709н, ОбластиИЗначения, Ложь);     // добавим в стр 10. Стр. 9 = 7-8. Необращаемые были не учтены в стр 7, поэтому стр 9 правильная.  
		ЗапомнитьСумму("Б1300", СуммаБ0709н, ОбластиИЗначения, Ложь);     // добавим в стр 13. Из строки 12 надо убрать, но начальный итог по стр 7 не содержит эту сумму
		ЗапомнитьСумму("Б1600", СуммаБ0709н, ОбластиИЗначения, Ложь);     // добавим в итог. Стр 12 не включает эту сумму.
		ЗапомнитьСумму("Б0709н", 0, ОбластиИЗначения, Истина);            // очиститм буферное поле. 
	КонецЕсли;
	//ОбщиеФункции.РасчетИтогов(ТаблицаНастройки, ОбластиИЗначения);
	
	//НУ
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "ДанныеН", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
		
	Если ТаблицаНастройки.Количество() = 0 Тогда 
		
		Сообщить("Отсутствует настройка для отчета");
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
		Возврат;
		
	КонецЕсли;	
	
	ПрочиеДоходы.Очистить();
	ПрочиеРасходы.Очистить();
		
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(Организация, СчетДоверительногоУправления, ДатаКонечная,"НалоговыйУчет", ДатаНачальная);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "Н0708", "Н0809", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы);

	//купон по необращаемым облигациям должен входить в два раздела   
	СуммаН0709н = ОбщиеФункции.ВернутьСохраненноеЗначение("Н0709н", ОбластиИЗначения);
	Если СуммаБ0709н <> 0 Тогда
		ЗапомнитьСумму("Н0709", СуммаН0709н, ОбластиИЗначения, Ложь);
		ЗапомнитьСумму("Н0700", СуммаН0709н, ОбластиИЗначения, Ложь);
		ЗапомнитьСумму("Н1000", СуммаН0709н, ОбластиИЗначения, Ложь);  
		ЗапомнитьСумму("Н1300", СуммаН0709н, ОбластиИЗначения, Ложь);  
		ЗапомнитьСумму("Н1600", СуммаН0709н, ОбластиИЗначения, Ложь);  
		ЗапомнитьСумму("Н0709н", 0, ОбластиИЗначения, Истина);
	КонецЕсли;	
	
	//вывод формы
	Отчет = ПолучитьМакет("Отчет");
	ОбластьОтчет = Отчет.ПолучитьОбласть("Отчет");
	
	//шапка 
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ДатаКонечная, Организация, СчетДоверительногоУправления);
	//
	ОбластьОтчет.Параметры.Заполнить(ПараметрыШапки);
	ОбластьОтчет.Параметры.ДатаДоговора = Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьОтчет.Параметры.ПериодОтчета = ПредставлениеПериода(ДатаНачальная, ДатаКонечная, "ФП=Истина");
	
	//показатели	
	ОбщиеФункции.ЗаполнениеОбластиЗначениями(ОбластьОтчет, ОбластиИЗначения); 	
	
	// Подписи	
	
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхРуководитель") Тогда 
		СтруктураДанныхРуководитель = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхРуководитель;	
		Если ЗначениеЗаполнено(СтруктураДанныхРуководитель) Тогда
			ОбластьОтчет.Параметры.ДолжностьДиректор = СтруктураДанныхРуководитель.Должность + " (на основании " + СтруктураДанныхРуководитель.ОснованиеПолномочий +  ")";
			ОбластьОтчет.Параметры.Руководитель = СтруктураДанныхРуководитель.КонтактноеЛицо;			
		КонецЕсли;	
	КонецЕсли;
		
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлавбух") Тогда 
		СтруктураДанныхГлавбух = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхГлавбух;
		Если ЗначениеЗаполнено(СтруктураДанныхГлавбух) Тогда
			ОбластьОтчет.Параметры.ДолжностьГлавбух = СтруктураДанныхГлавбух.Должность;
			ОбластьОтчет.Параметры.ГлавБух = СтруктураДанныхГлавбух.КонтактноеЛицо;			
		КонецЕсли;
	КонецЕсли;	
	
	//
	ДокументРезультат.Вывести(ОбластьОтчет);

	//Расшифровка
	ОбщиеФункции.ПечатьРасшифровки(ПолучитьМакет("Расшифровка"), ДокументРасшифровка, ТабРасшифровки);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры	

Процедура ЗапомнитьСумму(ИмяПараметра, ЗначениеПараметра, ОбластиИЗначения, Замена = Ложь)
	
	Перем ТекущееЗначение;
	
	Если ОбластиИЗначения.Свойство(ИмяПараметра, ТекущееЗначение) И НЕ Замена Тогда 
		ОбластиИЗначения[ИмяПараметра] = ТекущееЗначение + ЗначениеПараметра;
	Иначе
		ОбластиИЗначения.Вставить(ИмяПараметра, ЗначениеПараметра);
	КонецЕсли;			
	
КонецПроцедуры

Процедура ПроверкаНастроек(ДокументРезультат)	Экспорт
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
	
	МакетНастройка = ПолучитьМакет("Настройка");	
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.БухгалтерскийУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.БухгалтерскийУчет);	
	ТаблицаНастройкиБ = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);	
	ТаблицаНастройкиН = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "ДанныеН", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ТаблицаНастройкиБ, ТаблицаНастройкиН);	
	
	ВидыУчета = Новый Массив;
	ВидыУчета.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
	ВидыУчета.Добавить(Перечисления.ВидыУчета.БухгалтерскийУчет);
		
	Параметры = Новый Структура;
	Параметры.Вставить("ВидыУчета", ВидыУчета);
	Параметры.Вставить("Организация", ЭтотОбъект.Организация);
	Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Параметры.Вставить("ОтчетнаяДата", ЭтотОбъект.Период.ДатаОкончания);
	Параметры.Вставить("НачальнаяДата", ЭтотОбъект.Период.ДатаНачала);	
	
	ОбщиеФункции.ПроверкаНастроек(ДокументРезультат, ТаблицаНастройкиН, Параметры);
		
КонецПроцедуры
